SUBJECT_TYPES = [
    ('university_required', 'متطلب جامعي اجباري'),
    ('university_elective', 'متطلب جامعي اختياري'),
    ('college_required', 'متطلب كلية اجباري'),
    ('major_required', 'متطلب تخصص اجباري'),
    ('major_elective', 'متطلب تخصص اختياري'),
    ('corrective', 'استدراكي'),
]

DAYS_OF_WEEK = [
    (0, 'ح'),
    (1, 'ن'),
    (2, 'ث'),
    (3, 'ر'),
    (4, 'خ'),
    (5, 'ج'),
    (6, 'س'),
]

SYMBOLS = [
    ('A',  'A',  4.00),
    ('A-', 'A-', 3.75),
    ('B+', 'B+', 3.50),
    ('B',  'B',  3.25),
    ('B-', 'B-', 3.00),
    ('C+', 'C+', 2.75),
    ('C',  'C',  2.50),
    ('C-', 'C-', 2.00),
    ('D+', 'D+', 1.75),
    ('D',  'D',  1.25),
    ('D-', 'D-', 1.00),
    ('F*', 'F*', 0.50),
]

SEMESTER_CHOICES = [
        (1, 'الفصل الاول'),
        (2, 'الفصل الثاني'),
        (3, 'الفصل الصيفي'),
]

STATUS = [
    ('pending', 'قيد الانتظار'),
    ('approved', 'مقبول'),
    ('rejected', 'مرفوض'),
]